In [28]:
import pandas as pd
import psycopg2
import sqlalchemy

In [29]:
connection = sqlalchemy.create_engine(f'postgresql+psycopg2://myusername@0.0.0.0:5432/postgres')

In [31]:
# Accountants report for total cost by month of 2022
query = """ select year, month, sum(total_transaction_cost) as total_cost 
            from transaction_fact, date_dim
            where transaction_fact.date_key = date_dim.date_key
            group by year, month"""

df_mysql = pd.read_sql(query, con = connection)
df_mysql.head()

   year  month   total_cost
0  2022      3  1187.991417
1  2022      4   914.995204
2  2022      5  1047.174946

In [33]:
# A report on security, cost, and quantity for Ethel by fund by security
query = """ select 
                fund,
                trader, 
                security, 
                sum(quantity) as quantity, 
                sum(total_transaction_cost) as total_cost 
            from trader_dim, transaction_fact, security_dim
            where 
                trader_dim.trader_key = transaction_fact.trader_key and 
                transaction_fact.security_key = security_dim.security_key and
                trader = 'Ethel'
            group by trader_dim.trader, trader_dim.fund, security"""

df_mysql = pd.read_sql(query, con = connection)
df_mysql.head()

          fund trader security  quantity  total_cost
0  Equity Fund  Ethel     GOOG      74.0   28.798195
1  Equity Fund  Ethel      IBM     162.0  104.502664
2  Equity Fund  Ethel     TSLA     167.0  126.387904
3  Future Fund  Ethel     CLU2     191.0  100.294470
4  Future Fund  Ethel     EDU8     218.0   63.312216